# Importando Pandas

In [42]:
import pandas as pd

## Importando dados IBGE
https://servicodados.ibge.gov.br/api/docs/censos/nomes?versao=2

In [43]:
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')

In [44]:
nomes_f.shape

(200, 5)

In [45]:
nomes_m.shape

(200, 5)

In [46]:
print('Quantidades de nomes: {}'.format(str(len(nomes_f) + len(nomes_m))))

Quantidades de nomes: 400

In [47]:
#Juntando os dados em uma variável
frames = [nomes_f, nomes_m]

In [48]:
frames

[          nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns],           nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns]]

In [49]:
# Criando um DataFrame
nomes = pd.concat(frames)['nome'].to_frame()

In [50]:
nomes.sample(5)

        nome
48    RAQUEL
59    ISABEL
35     CARLA
63    MIGUEL
173  JAILSON

## Incluindo ID dos alunos

In [51]:
import numpy as np
np.random.seed(123)

In [52]:
# atribuindo quantidades de nomes em uma variável e exibindo o resultado
total_alunos = len(nomes)
total_alunos

400

In [53]:
#Adicionando coluna id_aluno com valores de id aleatórios
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1

In [54]:
nomes.sample(5)

          nome  id_aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [55]:
#cirando array de strings com domínios
dominios = ['@dominioemail.com.br', '@servicoemail.com']
#criando e adicionando coluna com valores aleatórios de do array de domínios para os alunos
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [56]:
nomes.sample(5)

          nome  id_aluno               dominio
84    SEVERINO        78  @dominioemail.com.br
0         JOSE       331     @servicoemail.com
179       IAGO       340  @dominioemail.com.br
10      SANDRA       174  @dominioemail.com.br
171  TERESINHA        45  @dominioemail.com.br

In [57]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [58]:
nomes.sample(5)

       nome  id_aluno               dominio                       email
114  ARTHUR       320  @dominioemail.com.br  arthur@dominioemail.com.br
57   DAIANE       303     @servicoemail.com     daiane@servicoemail.com
85   HELENA       221  @dominioemail.com.br  helena@dominioemail.com.br
183   IRACI         8  @dominioemail.com.br   iraci@dominioemail.com.br
189   DALVA       137  @dominioemail.com.br   dalva@dominioemail.com.br